//+------------------------------------------------------------------+
//|                                                       Test01.mq5 |
//|                                   |
//|                                             
//+------------------------------------------------------------------+
#property copyright ""
#property link      "https://www.mql5.com"
#property version   "1.00"

#include "runner/DebugRun01.mqh"
CRunerRe* runer;
//+------------------------------------------------------------------+
//| Expert initialization function                                   |
//+------------------------------------------------------------------+
int OnInit()
  {
  
   //EventSetTimer(60); // 设置定时器，每60秒执行一次
   EventSetMillisecondTimer(100);
//---
   runer=new CRunerRe();
   runer.init();
//---
   return(INIT_SUCCEEDED);
  }
//+------------------------------------------------------------------+
//| Expert deinitialization function                                 |
//+------------------------------------------------------------------+
void OnDeinit(const int reason)
  {
//---
    EventKillTimer();
    
    
    delete runer;
  }

//+------------------------------------------------------------------+
//+------------------------------------------------------------------+
//| Expert tick function                                             |
//+------------------------------------------------------------------+
void OnTick()
{    
    TimerRun();
}

//+------------------------------------------------------------------+
//| Run function - 未来功能实现                                       |
//+------------------------------------------------------------------+
void TimerRun()
{

   static datetime openLastTime = 0; 
   datetime curTime=TimeCurrent();        
   if((curTime-openLastTime)>10) 
   {                   
       openLastTime = curTime; 
       runer.refresh();       
   }
}


//+------------------------------------------------------------------+

//+------------------------------------------------------------------+
//| Run function - 未来功能实现                                       |
//+------------------------------------------------------------------+
void Run()
{
   //---      
   //refresh
   runer.refresh();   
   
}

